---
kind: method
id: M:Autodesk.Revit.DB.GBXMLExportOptions.#ctor
source: html/a4714450-fa1f-8f63-c3e3-ff4c195d662e.htm
---
# Autodesk.Revit.DB.GBXMLExportOptions.#ctor Method

Constructs a new instance of the options used to export a model in gbXML (green-building) format.

## Syntax (C#)
```csharp
public GBXMLExportOptions()
```